import requests
from pywebio.output import put_success, put_error, put_warning, put_image, put_html, put_table
from pywebio.session import run_js
from pywebio import start_server




student_grades_9a = {

    "Олександр Іванович Петров": 85,

    "Марія Сергіївна Іванова": 90,

    "Дмитро Олександрович Сидоров": 78

}

student_grades_9b = {

    "Катерина Петрівна Коваленко": 88,

    "Іван Дмитрович Кузьменко": 92,

    "Ольга Вікторівна Литвиненко": 80

}

new_student_dict = student_grades_9a | student_grades_9b
print(new_student_dict)






text = '''Технології розвиваються стрімко. Кожен день ми спостерігаємо нові досягнення в науці та техніці. Комп'ютери стають все потужнішими, а програмне забезпечення – складнішим. Проте, разом з цими досягненнями зростає і потреба в нових спеціалістах, здатних працювати з сучасними технологіями.
Важливо пам'ятати, що розвиток технологій впливає не лише на виробництво, але й на повсякденне життя людей. Смартфони, комп'ютери, розумні будинки, інтернет речей – все це робить наше життя зручнішим і ефективнішим. Технології змінюють наше життя кожного дня.
Однак, не слід забувати про кібербезпеку. Захист даних стає все важливішим питанням, адже зростання обсягу цифрової інформації вимагає надійних рішень для її захисту. Розробка нових методів шифрування та аутентифікації – ключ до безпеки в цифровому світі. Технології безпеки постійно розвиваються.
Таким чином, можна сказати, що технологічний прогрес має свої переваги та виклики. Основне завдання – знаходити баланс між інноваціями та безпекою, щоб забезпечити стабільний розвиток суспільства. Технології завжди будуть важливими для розвитку суспільства.'''

words_quanity = set(text)
words_calculation = len(words_quanity)
print(f'Слів у тексті: {words_calculation}')


letters = ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M',  'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z']

englisch_letters = letters[2:7]
print(englisch_letters)


every_second_letter = letters[1::2]
print(every_second_letter)

letters_but_not = letters[25:15: -1]
print(letters_but_not)


first_letters = letters[0:3]
print(first_letters)
